In [1]:
import pandas as pd
import datetime as dt
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
import sqlite3
import psycopg2

## Create Tornado table

In [69]:
tornadoes = "1950-2018_all_tornadoes.csv"

In [70]:
#read data

tornadoes_report = pd.read_csv(tornadoes, delimiter=",")

In [71]:
#Rename columns
tornadoes_report = tornadoes_report.rename(columns={"om":"Tornado ID","date":"Date","time":"Time","tz":"Time Zone",
                                                  "st": "State", "mag":"Magnitude fscale", "inj":"Injuries","fat":"Fatalities",
                                                 "loss": "Est. Property Loss", "slat":"Starting Latitude","slon":"Starting Longitude",
                                                 "elat":"Ending Latitude", "elon":"Ending Longitude", "len": "Length in miles", "wid":"Width in yards"
                                                  })

In [72]:
#Create DF
tornado_df = pd.DataFrame(tornadoes_report[["Tornado ID","yr","mo","dy","Date","State","Magnitude fscale","Injuries",
                                          "Fatalities", "Est. Property Loss", "Starting Latitude", "Starting Longitude",
                                          "Ending Latitude", "Ending Longitude", "Length in miles", "Width in yards"]])

tornado_df.head()

,Tornado ID,yr,mo,dy,Date,State,Magnitude fscale,Injuries,Fatalities,Est. Property Loss,Starting Latitude,Starting Longitude,Ending Latitude,Ending Longitude,Length in miles,Width in yards
0,1,1950,1,3,1950-01-03,MO,3,3,0,6.0,38.77,-90.22,38.83,-90.03,9.5,150
1,1,1950,1,3,1950-01-03,MO,3,3,0,6.0,38.77,-90.22,38.82,-90.12,6.2,150
2,1,1950,1,3,1950-01-03,IL,3,0,0,5.0,38.82,-90.12,38.83,-90.03,3.3,100
3,2,1950,1,3,1950-01-03,IL,3,3,0,5.0,39.10,-89.30,39.12,-89.23,3.6,130
4,3,1950,1,3,1950-01-03,OH,1,1,0,4.0,40.88,-84.58,0.00,0.00,0.1,10

In [73]:
# Create a copy of the tornado dataframe for the 
new_t_df = tornado_df.copy()
new_t_df.head()

,Tornado ID,yr,mo,dy,Date,State,Magnitude fscale,Injuries,Fatalities,Est. Property Loss,Starting Latitude,Starting Longitude,Ending Latitude,Ending Longitude,Length in miles,Width in yards
0,1,1950,1,3,1950-01-03,MO,3,3,0,6.0,38.77,-90.22,38.83,-90.03,9.5,150
1,1,1950,1,3,1950-01-03,MO,3,3,0,6.0,38.77,-90.22,38.82,-90.12,6.2,150
2,1,1950,1,3,1950-01-03,IL,3,0,0,5.0,38.82,-90.12,38.83,-90.03,3.3,100
3,2,1950,1,3,1950-01-03,IL,3,3,0,5.0,39.10,-89.30,39.12,-89.23,3.6,130
4,3,1950,1,3,1950-01-03,OH,1,1,0,4.0,40.88,-84.58,0.00,0.00,0.1,10

In [74]:
#  Create new columns and reduce to what is needed
columnsTitles = ["Tornado ID", "yr", "mo", "Magnitude fscale", "F0", "F1", "F2", "F3", "F4", "F5", "Total"]

new_t_df = new_t_df.reindex(columns=columnsTitles)
new_t_df.head()

   Tornado ID    yr  mo  Magnitude fscale  F0  F1  F2  F3  F4  F5  Total
0           1  1950   1                 3 NaN NaN NaN NaN NaN NaN    NaN
1           1  1950   1                 3 NaN NaN NaN NaN NaN NaN    NaN
2           1  1950   1                 3 NaN NaN NaN NaN NaN NaN    NaN
3           2  1950   1                 3 NaN NaN NaN NaN NaN NaN    NaN
4           3  1950   1                 1 NaN NaN NaN NaN NaN NaN    NaN

In [75]:
#  Fill NaN with zero
new_t_df = new_t_df.fillna(0)

new_t_df[['F0']] = new_t_df[['F0']].astype(int)
new_t_df[['F1']] = new_t_df[['F1']].astype(int)
new_t_df[['F2']] = new_t_df[['F2']].astype(int)
new_t_df[['F3']] = new_t_df[['F3']].astype(int)
new_t_df[['F4']] = new_t_df[['F4']].astype(int)
new_t_df[['F5']] = new_t_df[['F5']].astype(int)
new_t_df[['Total']] = new_t_df[['Total']].astype(int)

new_t_df.head()

   Tornado ID    yr  mo  Magnitude fscale  F0  F1  F2  F3  F4  F5  Total
0           1  1950   1                 3   0   0   0   0   0   0      0
1           1  1950   1                 3   0   0   0   0   0   0      0
2           1  1950   1                 3   0   0   0   0   0   0      0
3           2  1950   1                 3   0   0   0   0   0   0      0
4           3  1950   1                 1   0   0   0   0   0   0      0

In [76]:
new_t_df = new_t_df.drop_duplicates(subset=None, keep='first', inplace=False)
new_t_df.head()

   Tornado ID    yr  mo  Magnitude fscale  F0  F1  F2  F3  F4  F5  Total
0           1  1950   1                 3   0   0   0   0   0   0      0
3           2  1950   1                 3   0   0   0   0   0   0      0
4           3  1950   1                 1   0   0   0   0   0   0      0
5           4  1950   1                 3   0   0   0   0   0   0      0
6           5  1950   1                 2   0   0   0   0   0   0      0

In [78]:
cnt1 = new_t_df.groupby(['yr', 'mo']).count()
newest_df = pd.DataFrame(cnt1)
newest_df.head(15)

         Tornado ID  Magnitude fscale  F0  F1  F2  F3  F4  F5  Total
yr   mo
1950 1            7                 7   7   7   7   7   7   7      7
     2           21                21  21  21  21  21  21  21     21
     3           21                21  21  21  21  21  21  21     21
     4           15                15  15  15  15  15  15  15     15
     5           61                61  61  61  61  61  61  61     61
     6           28                28  28  28  28  28  28  28     28
     7           23                23  23  23  23  23  23  23     23
     8           13                13  13  13  13  13  13  13     13
     9            3                 3   3   3   3   3   3   3      3
     10           2                 2   2   2   2   2   2   2      2
     11           4                 4   4   4   4   4   4   4      4
     12           4                 4   4   4   4   4   4   4      4
1951 1            2                 2   2   2   2   2   2   2      2
     2           10                10  10  10  10  10  10  10     10
     3            6                 6   6   6   6   6   6   6      6

## DRAFT ONLY - Starting to Build Tornado and ENSO Data Table... pete

In [37]:
enso = "oni_enso.csv"
#read data

enso_data = pd.read_csv(enso, delimiter=",")

In [38]:
#Rename columns
enso_data = enso_data.rename(columns={"SEAS":"Season","YR":"yr","TOTAL":"Total","ANOM":"Anomaly"
                                     })
                                      
enso_data.head()

  Season    yr  Total  Anomaly
0    DJF  1950  24.72    -1.53
1    JFM  1950  25.17    -1.34
2    FMA  1950  25.75    -1.16
3    MAM  1950  26.12    -1.18
4    AMJ  1950  26.32    -1.07

In [39]:
new_enso = enso_data.copy()
new_enso.head(20)

   Season    yr  Total  Anomaly
0     DJF  1950  24.72    -1.53
1     JFM  1950  25.17    -1.34
2     FMA  1950  25.75    -1.16
3     MAM  1950  26.12    -1.18
4     AMJ  1950  26.32    -1.07
5     MJJ  1950  26.31    -0.85
6     JJA  1950  26.21    -0.54
7     JAS  1950  25.96    -0.42
8     ASO  1950  25.76    -0.39
9     SON  1950  25.63    -0.44
10    OND  1950  25.48    -0.60
11    NDJ  1950  25.34    -0.80
12    DJF  1951  25.42    -0.82
13    JFM  1951  25.96    -0.54
14    FMA  1951  26.74    -0.17
15    MAM  1951  27.48     0.18
16    AMJ  1951  27.75     0.36
17    MJJ  1951  27.75     0.58
18    JJA  1951  27.44     0.70
19    JAS  1951  27.28     0.89

In [40]:
# df.loc[df.my_channel > 20000, 'my_channel'] = 0

In [41]:
new_enso["mo"] = new_enso.loc[new_enso.Season == "DJF", "mo"] = 1
new_enso.head()

  Season    yr  Total  Anomaly  mo
0    DJF  1950  24.72    -1.53   1
1    JFM  1950  25.17    -1.34   1
2    FMA  1950  25.75    -1.16   1
3    MAM  1950  26.12    -1.18   1
4    AMJ  1950  26.32    -1.07   1

In [42]:
new_enso.loc[new_enso['Season'].eq("DJF"), "mo"] = 1
new_enso.loc[new_enso['Season'].eq("JFM"), "mo"] = 2 
new_enso.loc[new_enso['Season'].eq("FMA"), "mo"] = 3 
new_enso.loc[new_enso['Season'].eq("MAM"), "mo"] = 4 
new_enso.loc[new_enso['Season'].eq("AMJ"), "mo"] = 5 
new_enso.loc[new_enso['Season'].eq("MJJ"), "mo"] = 6 
new_enso.loc[new_enso['Season'].eq("JJA"), "mo"] = 7 
new_enso.loc[new_enso['Season'].eq("JAS"), "mo"] = 8 
new_enso.loc[new_enso['Season'].eq("ASO"), "mo"] = 9 
new_enso.loc[new_enso['Season'].eq("SON"), "mo"] = 10 
new_enso.loc[new_enso['Season'].eq("OND"), "mo"] = 11 
new_enso.loc[new_enso['Season'].eq("NDJ"), "mo"] = 12 
new_enso.head(30)

   Season    yr  Total  Anomaly  mo
0     DJF  1950  24.72    -1.53   1
1     JFM  1950  25.17    -1.34   2
2     FMA  1950  25.75    -1.16   3
3     MAM  1950  26.12    -1.18   4
4     AMJ  1950  26.32    -1.07   5
5     MJJ  1950  26.31    -0.85   6
6     JJA  1950  26.21    -0.54   7
7     JAS  1950  25.96    -0.42   8
8     ASO  1950  25.76    -0.39   9
9     SON  1950  25.63    -0.44  10
10    OND  1950  25.48    -0.60  11
11    NDJ  1950  25.34    -0.80  12
12    DJF  1951  25.42    -0.82   1
13    JFM  1951  25.96    -0.54   2
14    FMA  1951  26.74    -0.17   3
15    MAM  1951  27.48     0.18   4
16    AMJ  1951  27.75     0.36   5
17    MJJ  1951  27.75     0.58   6
18    JJA  1951  27.44     0.70   7
19    JAS  1951  27.28     0.89   8
20    ASO  1951  27.14     0.99   9
21    SON  1951  27.22     1.15  10
22    OND  1951  27.12     1.04  11
23    NDJ  1951  26.95     0.81  12
24    DJF  1952  26.78     0.53   1
25    JFM  1952  26.87     0.37   2
26    FMA  1952  27.25     0.34   3
27    MAM  1952  27.60     0.29   4
28    AMJ  1952  27.59     0.20   5
29    MJJ  1952  27.17     0.00   6

I want to remove the "Season" column, and then add the tornado counts by category (F0, F1,...) and totals

In [43]:
new_enso[['mo']] = new_enso[['mo']].astype(int)
new_enso.head()

  Season    yr  Total  Anomaly  mo
0    DJF  1950  24.72    -1.53   1
1    JFM  1950  25.17    -1.34   2
2    FMA  1950  25.75    -1.16   3
3    MAM  1950  26.12    -1.18   4
4    AMJ  1950  26.32    -1.07   5

In [44]:
columnsTitles = ["yr", "mo", "Total", "Anomaly"]

new_enso = new_enso.reindex(columns=columnsTitles)
new_enso.head()

     yr  mo  Total  Anomaly
0  1950   1  24.72    -1.53
1  1950   2  25.17    -1.34
2  1950   3  25.75    -1.16
3  1950   4  26.12    -1.18
4  1950   5  26.32    -1.07

## DRAFT ONLY - *********... pete

In [21]:
engine = sqlalchemy.create_engine("postgresql://postgres:YOURPASSWORD@localhost/Tornadoes_USA")
conn = engine.connect()

In [7]:
table_name = 'tornadoes'
tornado_df.to_sql(table_name, conn, index=False, if_exists='replace')

In [9]:
engine.execute('ALTER TABLE tornadoes ALTER COLUMN "Date" TYPE Date USING "Date"::date')

## Create Mobile Home table

In [22]:
mobile_homes = "Mobile_Home_Parks.csv"

In [23]:
#read data

mobile_data = pd.read_csv(mobile_homes, delimiter=",")

In [24]:
#Create DF
mobile_df = pd.DataFrame(mobile_data[["OBJECTID","NAME","ADDRESS","CITY","STATE","ZIP",
                                      "TYPE","STATUS","COUNTY","LATITUDE","LONGITUDE",
                                      "NAICS_DESC","VAL_DATE","UNITS","SIZE"]])


mobile_df.head()

,OBJECTID,NAME,ADDRESS,CITY,STATE,ZIP,TYPE,STATUS,COUNTY,LATITUDE,LONGITUDE,NAICS_DESC,VAL_DATE,UNITS,SIZE
0,1,HARDIE'S MOBILE HOME PARK,1 ALLEN DRIVE,FORT WALTON BEACH,FL,32547,MOBILE HOME PARK,OPEN,OKALOOSA,30.441261,-86.624066,RESIDENTIAL TRAILER PARKS,11/10/2015,12,SMALL
1,2,CRESTVIEW RV PARK,4050 FERDON BOULEVARD,CRESTVIEW,FL,32536,RECREATIONAL VEHICLE PARK,CLOSED,OKALOOSA,30.719016,-86.571622,RECREATIONAL VEHICLE PARKS,6/8/2018,-999,SMALL
2,3,HOMESTEAD TRAILER PARK,304 REEVES STREET,NICEVILLE,FL,32578,MOBILE HOME PARK,OPEN,OKALOOSA,30.511577,-86.462842,RESIDENTIAL TRAILER PARKS,11/10/2015,112,MEDIUM
3,4,HOUSTON PARK MOBILE HOME PARK,239 CARMEL DRIVE,FORT WALTON BEACH,FL,32547,MOBILE HOME PARK,OPEN,OKALOOSA,30.442420,-86.647331,RESIDENTIAL TRAILER PARKS,11/10/2015,6,SMALL
4,5,HUDSON MOBILE HOME PARK,826 MAYO TRAIL,CRESTVIEW,FL,32536,MOBILE HOME PARK,OPEN,OKALOOSA,30.762918,-86.592889,RESIDENTIAL TRAILER PARKS,6/11/2018,-999,SMALL

In [25]:
table_name = 'mobile_homes'
mobile_df.to_sql(table_name, conn, index=False, if_exists='replace')

In [26]:
engine.execute('ALTER TABLE mobile_homes ALTER COLUMN "VAL_DATE" TYPE Date USING "VAL_DATE"::date')